Tekla Open API Reference for Tekla Structures 2025
IEvents.OnClipPlaneChanged Method
 Called when user inserts, updates or deletes a clip plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void OnClipPlaneChanged(
	string eventName,
	params Object[] parameters
)
Sub OnClipPlaneChanged (
	eventName As String,
	ParamArray parameters As Object()
)
Parameters
eventName
Type: System.String
[Missing <param name="eventName"/> documentation for "M:Tekla.Structures.Model.IEvents.OnClipPlaneChanged(System.String,System.Object[])"]
parameters
Type: System.Object[]
[Missing <param name="parameters"/> documentation for "M:Tekla.Structures.Model.IEvents.OnClipPlaneChanged(System.String,System.Object[])"]
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace